nicolas-codemate/esp32-pixelcast/src/main.cpp
/**
 * ESP32-PixelCast
 *
 * Firmware for HUB75 LED matrix displays
 * Compatible with ESP32 Trinity and 64x64 panels
 *
 * @author nicolas-codemate
 * @license MIT
 * @version 0.1.0
 */

#include <Arduino.h>
#include "config.h"
#include "weather_icons.h"

// Display
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>

// WiFi & Network
#include <WiFi.h>
#include <WiFiManager.h>
#include <ESPmDNS.h>

// Web Server
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <AsyncJson.h>

// MQTT
#include <PubSubClient.h>

// JSON
#include <ArduinoJson.h>

// Filesystem
#include <LittleFS.h>

// PNG decoding
#include <PNGdec.h>

// Compact font for small text (IP address, status)
#include <Fonts/TomThumb.h>

// NTP
#include <NTPClient.h>
#include <WiFiUdp.h>

// HTTPS for LaMetric icon download
#include <WiFiClientSecure.h>
#include <HTTPClient.h>

// OTA updates
#include <ArduinoOTA.h>

// ============================================================================
// Application System - Structures
// ============================================================================

struct AppItem {
    char id[24];
    char text[64];
    char icon[32];
    uint32_t textColor;
    uint16_t duration;          // Display duration in ms
    uint32_t lifetime;          // Expiration time (0 = permanent)
    uint32_t createdAt;         // Creation timestamp
    int8_t priority;            // -10 to 10 (higher = more important)
    bool active;
    bool isSystem;              // System apps cannot be deleted
};

// ============================================================================
// Global Objects
// ============================================================================

// Display
MatrixPanel_I2S_DMA *dma_display = nullptr;

// Network
WiFiClient wifiClient;
WiFiManager wifiManager;

// Web Server
AsyncWebServer webServer(WEB_SERVER_PORT);

// MQTT
PubSubClient mqttClient(wifiClient);

// NTP
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, NTP_SERVER, NTP_OFFSET, NTP_UPDATE_INTERVAL);

// State
bool wifiConnected = false;
bool mqttConnected = false;
bool filesystemReady = false;
uint8_t currentBrightness = DEFAULT_BRIGHTNESS;
bool pendingReboot = false;
unsigned long rebootRequestTime = 0;

// Application Manager
AppItem apps[MAX_APPS];
uint8_t appCount = 0;
int8_t currentAppIndex = -1;
int8_t lastDisplayedAppIndex = -1;  // Track app switches for display clearing
unsigned long lastAppSwitch = 0;
bool appRotationEnabled = true;

// Scroll State
struct ScrollState {
    int16_t scrollOffset;
    unsigned long lastScrollTime;
    uint8_t scrollPhase;  // 0=pause_start, 1=scrolling, 2=pause_end
    bool needsScroll;
    int16_t textWidth;
    int16_t availableWidth;
};
ScrollState appScrollState;

// Icon Cache
struct CachedIcon {
    char name[32];
    uint16_t* pixels;  // RGB565 format
    uint8_t width;
    uint8_t height;
    bool valid;
    unsigned long lastUsed;
};
CachedIcon iconCache[MAX_ICON_CACHE];
PNG png;

// Temporary buffer for PNG decode callback
uint16_t* pngDecodeTarget = nullptr;
uint8_t pngDecodeWidth = 0;

// Settings from JSON
struct Settings {
    uint8_t brightness;
    bool autoRotate;
    uint16_t defaultDuration;
    char ntpServer[48];
    int32_t ntpOffset;
    bool clockEnabled;
    bool clockFormat24h;
    bool clockShowSeconds;
    uint32_t clockColor;
    bool dateEnabled;
    char dateFormat[16];
    uint32_t dateColor;
    bool mqttEnabled;
    char mqttServer[64];
    uint16_t mqttPort;
    char mqttUser[32];
    char mqttPassword[32];
    char mqttPrefix[32];
} settings;

// Weather Data (populated by POST /api/weather)
#define MAX_FORECAST_DAYS 7    // Max storage (1 week)
#define FORECAST_COLUMNS  3    // Columns displayed simultaneously

struct WeatherData {
    char currentIcon[32];
    int16_t currentTemp;
    int16_t currentTempMin;
    int16_t currentTempMax;
    uint8_t currentHumidity;
    struct ForecastDay {
        char icon[32];
        int16_t tempMin;
        int16_t tempMax;
        char dayName[4];  // "LUN", "MAR", etc.
    } forecast[MAX_FORECAST_DAYS];
    uint8_t forecastCount;     // Number of forecast days received
    unsigned long lastUpdate;
    bool valid;
};
WeatherData weatherData;

// Tracker Data (populated by POST /api/tracker)
struct TrackerData {
    char name[16];            // Key: "btc", "eth", "aapl"
    char symbol[8];           // Display: "BTC", "ETH"
    char icon[32];            // Icon name (LittleFS)
    char currencySymbol[8];   // "USD", "EUR"
    float currentValue;       // Price/value
    float changePercent;      // +2.14 or -1.5
    uint16_t sparkline[MAX_SPARKLINE_POINTS];  // Scaled 0-65535
    uint8_t sparklineCount;
    uint32_t symbolColor;     // Header color (0xRRGGBB)
    uint32_t sparklineColor;  // Chart color
    char bottomText[32];      // Optional footer
    unsigned long lastUpdate;
    bool valid;
};
TrackerData trackers[MAX_TRACKERS];
uint8_t trackerCount = 0;

// Notification Data
struct NotificationItem {
    char id[24];              // Unique ID ("notif_<millis>" or user-provided)
    char text[128];           // Notification text (longer than app's 64 chars)
    char icon[32];            // Icon filename
    uint32_t textColor;       // RGB color
    uint32_t backgroundColor; // RGB color for area outside card frame (0 = none)
    uint16_t duration;        // Display duration in ms (0 = hold mode)
    bool hold;                // Explicit hold flag (never auto-expires)
    bool urgent;              // Jumps to front of queue
    bool stack;               // Queue sequentially (true) vs replace current (false)
    bool active;              // Slot in use
    unsigned long displayedAt; // Timestamp when first displayed (0 = not yet shown)
};
NotificationItem notifications[MAX_NOTIFICATIONS];
uint8_t notificationCount = 0;
int8_t currentNotifIndex = -1;
int8_t savedAppIndex = -1;          // App to restore after notifications end
ScrollState notifScrollState;
unsigned long lastNotifScrollUpdate = 0;

