nicolas-codemate/esp32-pixelcast/src/main.cpp
            // Allocate or find existing tracker
            TrackerData* tracker = trackerAllocate(name.c_str());
            if (!tracker) {
                request->send(500, "application/json", "{\"error\":\"No tracker slot available\"}");
                return;
            }

            // Parse fields
            if (!doc["symbol"].isNull()) {
                strlcpy(tracker->symbol, doc["symbol"] | "", sizeof(tracker->symbol));
            }
            if (!doc["icon"].isNull()) {
                strlcpy(tracker->icon, doc["icon"] | "", sizeof(tracker->icon));
            }
            if (!doc["currency"].isNull()) {
                strlcpy(tracker->currencySymbol, doc["currency"] | "", sizeof(tracker->currencySymbol));
            }
            if (!doc["value"].isNull()) {
                tracker->currentValue = doc["value"].as<float>();
            }
            if (!doc["change"].isNull()) {
                tracker->changePercent = doc["change"].as<float>();
            }
            if (!doc["bottomText"].isNull()) {
                strlcpy(tracker->bottomText, doc["bottomText"] | "", sizeof(tracker->bottomText));
            }

            tracker->symbolColor = parseColorValue(doc["symbolColor"], tracker->symbolColor);
            tracker->sparklineColor = parseColorValue(doc["sparklineColor"], tracker->sparklineColor);

            // Parse sparkline data (float array -> scaled uint16)
            if (doc["sparkline"].is<JsonArray>()) {
                JsonArray sparkArr = doc["sparkline"];
                uint8_t count = min((int)sparkArr.size(), (int)MAX_SPARKLINE_POINTS);

                if (count >= 2) {
                    // Find min/max of float values
                    float minVal = sparkArr[0].as<float>();
                    float maxVal = minVal;
                    for (uint8_t i = 1; i < count; i++) {
                        float v = sparkArr[i].as<float>();
                        if (v < minVal) minVal = v;
                        if (v > maxVal) maxVal = v;
                    }

                    float range = maxVal - minVal;
                    if (range < 0.0001f) range = 1.0f;

                    // Scale to uint16 (0-65535)
                    for (uint8_t i = 0; i < count; i++) {
                        float normalized = (sparkArr[i].as<float>() - minVal) / range;
                        tracker->sparkline[i] = (uint16_t)(normalized * 65535.0f);
                    }
                    tracker->sparklineCount = count;
                }
            }

            tracker->lastUpdate = millis();

            // Register/update app in rotation
            char appId[32];
            snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name.c_str());
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_APP_DURATION;
            appAdd(appId, tracker->symbol, tracker->icon, 0xFFFFFF,
                   duration, 0, 0, false);

            Serial.printf("[TRACKER] Updated: %s (%s = %.2f)\n",
                         name.c_str(), tracker->symbol, tracker->currentValue);
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(trackerHandler);

    // ========================================================================
    // Notification API
    // ========================================================================

    // POST /api/notify/dismiss - Dismiss current notification
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/dismiss", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (notifDismiss()) {
            resetNotifScrollState();
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"No active notification\"}");
        }
    });

    // GET /api/notify/list - List all active notifications
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/list", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        doc["count"] = notificationCount;
        doc["currentIndex"] = currentNotifIndex;

        JsonArray arr = doc["notifications"].to<JsonArray>();
        for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
            if (!notifications[i].active) continue;
            JsonObject obj = arr.add<JsonObject>();
            obj["id"] = notifications[i].id;
            obj["text"] = notifications[i].text;
            obj["icon"] = notifications[i].icon;
            obj["duration"] = notifications[i].duration;
            obj["hold"] = notifications[i].hold;
            obj["urgent"] = notifications[i].urgent;
            obj["stack"] = notifications[i].stack;
            obj["displayed"] = notifications[i].displayedAt > 0;
            obj["current"] = (i == (uint8_t)currentNotifIndex);
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // POST /api/notify - Send a notification
    AsyncCallbackJsonWebHandler* notifyHandler = new AsyncCallbackJsonWebHandler("/api/notify",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /notify handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Text is required
            if (doc["text"].isNull() || strlen(doc["text"] | "") == 0) {
                request->send(400, "application/json", "{\"error\":\"Missing text\"}");
                return;
            }

            const char* text = doc["text"] | "";
            const char* id = doc["id"] | "";
            const char* icon = doc["icon"] | "";
            uint32_t textColor = parseColorValue(doc["color"], 0xFFFFFF);
            uint32_t bgColor = parseColorValue(doc["background"], 0x000000);
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_NOTIF_DURATION;
            bool hold = doc["hold"] | false;
            bool urgent = doc["urgent"] | false;
            bool stack = doc["stack"] | true;

            int8_t slot = notifAdd(id, text, icon, textColor, bgColor,
                                   duration, hold, urgent, stack);

            if (slot < 0) {
                request->send(503, "application/json", "{\"error\":\"Notification queue full\"}");
                return;
            }

            // Return the assigned ID
            char response[128];
            snprintf(response, sizeof(response),
                     "{\"success\":true,\"id\":\"%s\"}", notifications[slot].id);
            request->send(200, "application/json", response);
        });
    webServer.addHandler(notifyHandler);

    // POST /api/reboot - Reboot device (deferred to allow response to be sent)
    webServer.on("/api/reboot", HTTP_POST, [](AsyncWebServerRequest *request) {
        Serial.println("[API] Reboot requested");
        request->send(200, "application/json", "{\"success\":true,\"message\":\"Rebooting...\"}");
        pendingReboot = true;
        rebootRequestTime = millis();
    });

    // ========================================================================
    // Icon Management API
    // ========================================================================

    // GET /icons.html - Web interface for icon management
    webServer.on("/icons.html", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/html", ICONS_HTML);
    });

    // GET /api/icons/{name} - Serve icon file (must be before /api/icons to avoid prefix match)
    webServer.on("^\\/api\\/icons\\/([a-zA-Z0-9_-]+)$", HTTP_GET, [](AsyncWebServerRequest *request) {
        String iconName = request->pathArg(0);
        handleApiIconsServe(request, iconName);
    });

    // GET /api/icons - List all icons
    webServer.on("/api/icons", HTTP_GET, handleApiIconsList);

    // DELETE /api/icons?name={name} - Delete an icon
    webServer.on("/api/icons", HTTP_DELETE, handleApiIconsDelete);

