nicolas-codemate/esp32-pixelcast/src/main.cpp
void appCleanExpired() {
    unsigned long now = millis();
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && apps[i].lifetime > 0) {
            if (now - apps[i].createdAt > apps[i].lifetime) {
                Serial.printf("[APPS] App expired: %s\n", apps[i].id);
                apps[i].active = false;
                appCount--;
                if (currentAppIndex == i) {
                    currentAppIndex = -1;
                }
            }
        }
    }
}

AppItem* appGetNext() {
    if (appCount == 0) return nullptr;

    // Clean expired apps first
    appCleanExpired();
    if (appCount == 0) return nullptr;

    // Simple round-robin: find next active app after current
    int8_t startIndex = (currentAppIndex + 1) % MAX_APPS;

    for (uint8_t i = 0; i < MAX_APPS; i++) {
        int8_t idx = (startIndex + i) % MAX_APPS;
        if (apps[idx].active) {
            currentAppIndex = idx;
            return &apps[idx];
        }
    }

    return nullptr;
}

AppItem* appGetCurrent() {
    if (currentAppIndex >= 0 && currentAppIndex < MAX_APPS && apps[currentAppIndex].active) {
        return &apps[currentAppIndex];
    }
    return nullptr;
}

void loopApps() {
    if (!wifiConnected) return;

    // ---- Notification priority check (before app rotation) ----
    unsigned long now = millis();

    NotificationItem* currentNotif = notifGetCurrent();

    // Check if current notification has expired
    if (currentNotif && notifIsExpired(currentNotif)) {
        notifDismiss();
        resetNotifScrollState();
        currentNotif = notifGetNext();  // Try next in queue
        if (currentNotif) {
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If no current notification, check if new ones are queued
    if (!notifGetCurrent()) {
        currentNotif = notifGetNext();
        if (currentNotif) {
            // Save current app index to restore later (first time only)
            if (savedAppIndex < 0) {
                savedAppIndex = currentAppIndex;
            }
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers (prevents weather ghosting)
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If a notification is active, skip app rotation
    if (notifGetCurrent()) {
        return;
    }

    // Just finished all notifications: restore app rotation
    if (savedAppIndex >= 0) {
        currentAppIndex = savedAppIndex;
        savedAppIndex = -1;
        lastAppSwitch = now;
        resetScrollState();
        // Reset weather clock cache to force full redraw (not just seconds update)
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        Serial.println("[NOTIF] All dismissed, resuming app rotation");
        // Clear both DMA buffers to remove any notification pixel remnants,
        // then force immediate app redraw on both buffers
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        AppItem* restored = appGetCurrent();
        if (restored) {
            displayShowApp(restored);
            displayShowApp(restored);
            lastDisplayUpdate = now;
        }
    }

    // ---- Normal app rotation ----
    if (appCount == 0) return;

    AppItem* current = appGetCurrent();

    if (current == nullptr) {
        // No current app, get first one
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            // Force immediate redraw
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
        return;
    }

    // Check if current app duration has elapsed
    if (appRotationEnabled && (now - lastAppSwitch > current->duration)) {
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            Serial.printf("[APPS] Switched to: %s\n", current->id);
            // Force immediate redraw on app switch
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
    }
}

// ============================================================================
// Time Functions
// ============================================================================

void loopTime() {
    if (wifiConnected) {
        timeClient.update();
    }
}

// ============================================================================
// Display Loop
// ============================================================================

void loopDisplay() {
    if (!wifiConnected) return;

    unsigned long now = millis();
    bool needsRedraw = false;

    // ---- Notification display (priority over apps) ----
    NotificationItem* currentNotif = notifGetCurrent();
    if (currentNotif) {
        // Handle notification scroll animation
        if (notifScrollState.needsScroll) {
            if (now - lastNotifScrollUpdate >= SCROLL_SPEED) {
                lastNotifScrollUpdate = now;

                switch (notifScrollState.scrollPhase) {
                    case 0:  // pause_start
                        if (now - notifScrollState.lastScrollTime >= SCROLL_PAUSE) {
                            notifScrollState.scrollPhase = 1;
                            notifScrollState.lastScrollTime = now;
                        }
                        break;

                    case 1:  // scrolling
                        notifScrollState.scrollOffset++;
                        if (notifScrollState.scrollOffset >= notifScrollState.textWidth - notifScrollState.availableWidth + 10) {
                            notifScrollState.scrollPhase = 2;
                            notifScrollState.lastScrollTime = now;
                        }
                        needsRedraw = true;
                        break;

                    case 2:  // pause_end
                        if (now - notifScrollState.lastScrollTime >= SCROLL_PAUSE) {
                            notifScrollState.scrollOffset = 0;
                            notifScrollState.scrollPhase = 0;
                            notifScrollState.lastScrollTime = now;
                        }
                        break;
                }
            }
        }

        // Redraw notification on scroll or periodic update
        if (now - lastDisplayUpdate > 1000 || needsRedraw) {
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
        return;  // Skip app display while notification is active
    }

    // ---- Normal app display ----
    AppItem* current = appGetCurrent();
    needsRedraw = false;

    // Handle scroll animation (50ms updates for smooth scrolling)
    if (current && appScrollState.needsScroll) {
        if (now - lastScrollUpdate >= SCROLL_SPEED) {
            lastScrollUpdate = now;

            switch (appScrollState.scrollPhase) {
                case 0:  // pause_start
                    if (now - appScrollState.lastScrollTime >= SCROLL_PAUSE) {
                        appScrollState.scrollPhase = 1;
                        appScrollState.lastScrollTime = now;
                    }
                    break;

                case 1:  // scrolling
                    appScrollState.scrollOffset++;
                    // Check if text has scrolled completely
                    if (appScrollState.scrollOffset >= appScrollState.textWidth - appScrollState.availableWidth + 10) {
                        appScrollState.scrollPhase = 2;
                        appScrollState.lastScrollTime = now;
                    }
                    needsRedraw = true;
                    break;

                case 2:  // pause_end
                    if (now - appScrollState.lastScrollTime >= SCROLL_PAUSE) {
                        // Reset to beginning
                        appScrollState.scrollOffset = 0;
                        appScrollState.scrollPhase = 0;
                        appScrollState.lastScrollTime = now;
                    }
                    break;
            }
        }
    }

    // Regular display update (1000ms for non-scrolling content like clock)
    if (now - lastDisplayUpdate > 1000 || needsRedraw) {
        if (current) {
            displayShowApp(current);
        } else {
            // Fallback: show time if no apps
            displayShowTime();
        }
        lastDisplayUpdate = now;
    }
}

// ============================================================================
// Utility Functions
// ============================================================================

void logMemory() {
    Serial.printf("[MEM] Free heap: %d bytes, largest block: %d bytes\n",
        ESP.getFreeHeap(), ESP.getMaxAllocHeap());
}
